WB/src/DataProcessors/ОбменДанными/ОбменДанными.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбменДанными</name>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Продавцы</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

WB/src/Documents/ОтчетРеализации/ОтчетРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетРеализации</name>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Продавцы</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

WB/src/DataProcessors/ОбменДанными/Forms/Форма/Module.bsl
// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗагрузитьОтчетыРеализации(Команда)
	ЗагрузитьОтчетыРеализацииНаСервере(Объект.Продавец, Объект.НачалоПериода, Объект.КонецПериода);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура ЗагрузитьОтчетыРеализацииНаСервере(Продавец, НачалоПериода, КонецПериода)
	
	Документы.ОтчетРеализации.Загрузить(Продавец, НачалоПериода, КонецПериода);
	
КонецПроцедуры
#КонецОбласти
